Revit 2026 API

# MEPSystemRemove(ConnectorSet) Method

---

Removes connectors from system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Remove(
	ConnectorSet connectors
)
```
```vb
Public Sub Remove (
	connectors As ConnectorSet
)
```
```cpp
public:
void Remove(
	ConnectorSet^ connectors
)
```
```fsharp
member Remove :
        connectors : ConnectorSet -> unit
```

#### Parameters

connectors ConnectorSet
    The connectors to be removed from the system.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument elements is , or any element in that collection is . |
| ArgumentException | Thrown when some of the connectors can't be removed, or when trying to remove all connectors from the system. |
| InvalidOperationException | Thrown when the operation failed. |

#### Reference

MEPSystem Class

Remove Overload

Autodesk.Revit.DB Namespace